app/controllers/tasklists_controller.rb

  def index
    @tasklists = Tasklist.all
---
SELECT * FROM `tasklists`

  def show
    @tasklist = Tasklist.find(params[:id])
---
SELECT * FROM `tasklists` WHERE (`tasklists`.`id` = 1)

  def create
    @users = User.find(:all)
    @tasklist = Tasklist.new(params[:tasklist])
    if @tasklist.save
---
INSERT INTO [tasklists] ([name], [status], [project_id], [updated_at], [scope], [priority], [description], [genre], [due_date], [user_id], [created_at]) VALUES('Check limit rule 204', 'To start', 1, '2010-01-18 18:24:37.156', 'LIMIT', 'Urgent', 'test', 'Bug', '2010-01-17 23:00:00.000', 3, '2010-01-18 18:24:37.156')

  def edit
    @users = User.find(:all)
    @tasklist = Tasklist.find(params[:id])
---
SELECT * FROM `tasklists` WHERE (`tasklists`.`id` = 2)

  def update
    @users = User.find(:all)
    @tasklist = Tasklist.find(params[:id])
    if @tasklist.update_attributes(params[:tasklist])
---
SELECT * FROM `tasklists` WHERE (`tasklists`.`id` = 2)
UPDATE `tasklists` SET `updated_at` = '2010-01-16 17:33:54', `name` = 'test 23', `description` = 'test a la noix' WHERE `id` = 1

  def destroy
    @tasklist = Tasklist.find(params[:id])
    @tasklist.destroy
---
SELECT * FROM `tasklists` WHERE (`tasklists`.`id` = 1)
DELETE FROM `tasklists` WHERE `id` = 1